sslivins/arctic-simulator/sdkconfig.defaults
# Target: ESP32-S3 (M5Stack Atom S3)
CONFIG_IDF_TARGET="esp32s3"

# Serial flasher - Atom S3 uses USB-CDC
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Wi-Fi
CONFIG_ESP_WIFI_SSID=""
CONFIG_ESP_WIFI_PASSWORD=""

# HTTP Server
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# mDNS
CONFIG_MDNS_ENABLED=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# UART for Modbus
CONFIG_UART_ISR_IN_IRAM=y
